import "./Privacy.scss";
import { Helmet } from "react-helmet";

const Privacy = () => {
    return (
        <div className="ea">
            <Helmet>
                <title>
                    Политика конфиденциальности и согласие на обработку данных
                
                </title>
            </Helmet>
            <div className="toc">
                <div className="toc-link">
                    <a href="#privacy-policy">Политика конфиденциальности</a>
                </div>
                <div className="toc-link">
                    <a href="#data-consent">
                        Согласие на обработку персональных данных
                    </a>
                </div>
            </div>

            <h2 id="privacy-policy">
                Политика конфиденциальности сайта &quot;Play in Tune&quot;
            </h2>
            <p>Последнее обновление: июль 2024 года</p>
            <p>
                Добро пожаловать на сайт &quot;Play in Tune&quot; (доступный по
                адресу{" "}
                <a
                    href="https://diplom-rose-two.vercel.app"
                    rel="noreferrer"
                    target="_new"
                >
                    diplom-rose-two.vercel.app
                </a>
                ). Мы ценим ваше доверие и стремимся защищать вашу
                конфиденциальность. Наша политика конфиденциальности объясняет,
                какие виды информации мы собираем, когда вы посещаете наш сайт,
                и как мы используем эту информацию.
            </p>

            <h3>Сбор информации и использование</h3>
            <p>
                При посещении сайта &quot;Play in Tune&quot; мы можем собирать
                определенные данные автоматически, включая информацию о вашем
                браузере, IP-адресе, времени доступа и страницах, которые вы
                посетили. Эти данные используются исключительно для анализа
                трафика и улучшения работы нашего сайта.
            </p>
            <p>
                Мы также можем собирать персональную информацию, которую вы
                предоставляете добровольно при использовании определенных
                функций сайта, таких как регистрация или заполнение форм. Эта
                информация может включать ваше имя, адрес электронной почты или
                другие контактные данные. Мы используем эту информацию только
                для целей, связанных с предоставлением вам запрашиваемых услуг и
                коммуникаций.
            </p>

            <h3>Использование файлов cookie</h3>
            <p>
                Наш сайт может использовать файлы cookie и аналогичные
                технологии для улучшения пользовательского опыта и анализа
                поведения пользователей. Файлы cookie могут хранить информацию о
                ваших предпочтениях и действиях на сайте. Вы можете управлять
                использованием файлов cookie через настройки вашего браузера.
            </p>

            <h3>Предоставление информации третьим лицам</h3>
            <p>
                Мы не продаем, не обмениваем и не передаем вашу личную
                информацию третьим лицам без вашего согласия, за исключением
                случаев, предусмотренных законодательством.
            </p>

            <h3>Безопасность</h3>
            <p>
                Мы принимаем меры для защиты вашей личной информации от
                несанкционированного доступа или использования. Однако никакой
                метод передачи данных через интернет или метод электронного
                хранения не является на 100% безопасным, и мы не можем
                гарантировать абсолютную безопасность ваших данных.
            </p>

            <h3>Ссылки на другие сайты</h3>
            <p>
                Наш сайт может содержать ссылки на сторонние сайты, которые не
                контролируются нами. Мы не несем ответственности за содержание
                или практики конфиденциальности этих сайтов.
            </p>

            <h3>Изменения в политике конфиденциальности</h3>
            <p>
                Мы можем время от времени обновлять нашу политику
                конфиденциальности. Любые изменения будут опубликованы на этой
                странице, и, при необходимости, мы можем уведомить вас о
                значительных изменениях по электронной почте.
            </p>

            <h3>Связь с нами</h3>
            <p>
                Если у вас есть вопросы или предложения относительно нашей
                политики конфиденциальности, пожалуйста, свяжитесь с нами по
                адресу:{" "}
                <a href="mailto:contact@playintune.com" target="_blank">
                    contact@playintune.com
                </a>
                .
            </p>

            <h3>Согласие с политикой конфиденциальности</h3>
            <p>
                Используя наш сайт, вы соглашаетесь с нашей политикой
                конфиденциальности. Если вы не согласны с этой политикой,
                пожалуйста, не используйте наш сайт.
            </p>

            <p>Последнее обновление: июль 2024 года</p>

            <h2 id="data-consent">Согласие на обработку персональных данных</h2>
            <p>
                Я, нижеподписавшийся, добровольно предоставляю свое согласие на
                обработку моих персональных данных компанией &quot;Play in
                Tune&quot; (URL:{" "}
                <a
                    href="https://diplom-rose-two.vercel.app"
                    rel="noreferrer"
                    target="_new"
                >
                    diplom-rose-two.vercel.app
                </a>
                ).
            </p>
            <ol>
                <li>
                    <p>
                        <strong>Цель обработки персональных данных:</strong>{" "}
                        предоставление мне услуг и информации, связанных с
                        использованием сайта &quot;Play in Tune&quot;, включая
                        ответы на мои запросы и вопросы.
                    </p>
                </li>
                <li>
                    <p>
                        <strong>Собираемые персональные данные:</strong> имя,
                        адрес электронной почты, иные контактные данные, которые
                        я добровольно предоставляю при использовании функций
                        сайта.
                    </p>
                </li>
                <li>
                    <p>
                        <strong>Способы обработки данных:</strong> сбор, запись,
                        систематизация, накопление, хранение, уточнение
                        (обновление, изменение), извлечение, использование,
                        передача (распространение, предоставление, доступ),
                        обезличивание, блокирование, удаление, уничтожение
                        персональных данных.
                    </p>
                </li>
                <li>
                    <p>
                        <strong>Сроки обработки данных:</strong> персональные
                        данные обрабатываются до достижения целей их обработки
                        или до момента отзыва моего согласия на обработку
                        персональных данных.
                    </p>
                </li>
                <li>
                    <p>
                        <strong>Требования к защите данных:</strong> компания
                        &quot;Play in Tune&quot; обязуется принимать необходимые
                        организационные и технические меры для защиты моих
                        персональных данных от неправомерного или случайного
                        доступа, уничтожения, изменения, блокирования,
                        копирования, предоставления, распространения и других
                        неправомерных действий третьих лиц.
                    </p>
                </li>
                <li>
                    <p>
                        <strong>Отзыв согласия:</strong> я имею право отозвать
                        свое согласие на обработку персональных данных, направив
                        уведомление по адресу электронной почты:{" "}
                        <a href="mailto:contact@playintune.com" target="_blank">
                            contact@playintune.com
                        </a>
                        . В случае отзыва согласия компания &quot;Play in
                        Tune&quot; прекратит обработку моих персональных данных
                        и уничтожит их в срок, не превышающий 30 (тридцать)
                        рабочих дней.
                    </p>
                </li>
            </ol>
            <p>
                Я подтверждаю, что предоставление мной персональных данных
                осуществляется на основании моей воле и свободы, а также я
                осведомлен о своих правах и обязанностях в соответствии с
                законодательством о защите персональных данных.
            </p>
        </div>
    );
};

export default Privacy;
